Revit 2027 API
WallType.Function Property
 The wall function.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WallFunction Function { get; set; }
Public Property Function As WallFunction
	Get
	Set
public:
property WallFunction Function {
	WallFunction get ();
	void set (WallFunction value);
}
member Function : WallFunction with get, set
Property Value
WallFunction
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
WallType Class
Autodesk.Revit.DB Namespace